; domain
(define (domain monkey_heart_story)
(:requirements :typing :conditional-effects :universal-preconditions :disjunctive-preconditions :negative-preconditions :equality)
(:types animal location)

(:predicates
    (connected ?l1 ?l2 - location)
    (in ?a - animal ?l - location)
    (sick ?a)
    (travelling_together ?a1 ?a2 - animal)
    (foolish ?a - animal)
    (tricked_once ?a - animal)
    (trust ?a1 ?a2 - animal)
    (tricked_twice ?a - animal)
    (heart_eater ?a - animal)
    (want_heart ?a - animal)
)

(:action move
:parameters (?a - animal ?l1 ?l2 - location)
:precondition ( and (in ?a ?l1) (connected ?l1 ?l2))
:effect (and
    (in ?a ?l2)
    (forall (?a2 - animal)
    (when (and (in ?a2 ?l1) (or (travelling_together ?a ?a2) (travelling_together ?a2 ?a))) (in ?a2 ?l2))
    )
)
)

(:action trick
    :parameters (?a1 ?a2 - animal)
    :precondition (and (exists (?l - location) (and (in ?a1 ?l) (in ?a2 ?l)))
        (or (foolish ?a2) (not (tricked_once ?a2))) 
        (not (= ?a1 ?a2))
    )
    :effect (and (trust ?a2 ?a1)
        (when (not (tricked_once ?a2)) (tricked_once ?a2)) 
        (when (tricked_once ?a2) (tricked_twice ?a2))
    )
)

(:action move_together
    :parameters (?a1 ?a2 - animal)
    :precondition (or (trust ?a1 ?a2) (trust ?a2 ?a1))
    :effect (and (travelling_together ?a1 ?a2))
)

(:action eat_heart
    :parameters (?a1 ?a2 - animal)
    :precondition (and (exists (?l - location) (and (in ?a1 ?l) (in ?a2 ?l)))
        (tricked_twice ?a2) 
        (or (want_heart ?a1) (sick ?a1))
    )
    :effect (heart_eater ?a1)
)




)

; problem
(define (problem monkey_heart) (:domain monkey_heart_story)
(:objects 
the_monkey - animal
the_shark - animal
the_sultan - animal
the_lion - animal
the_donkey - animal
the_hare - animal
cliff - location
cave - location
tree - location
sea - location
forest - location
stream - location
)
(:init
    (in the_monkey tree)
    (in the_shark sea)
    (in the_sultan sea)
    (in the_lion cave)
    (in the_hare cave)
    (in the_donkey forest)
    (sick the_sultan)
    (sick the_lion)
    (connected tree cliff)
    (connected cave forest)
    (connected forest stream)
    (connected cliff sea)
    (connected sea cliff)
    (connected stream forest)
    (connected forest cave)
    (connected cliff tree)

    (foolish the_donkey)
    (want_heart the_hare)

)
(:goal (and
    (tricked_twice the_donkey)
    (tricked_once the_monkey)
    (tricked_once the_shark)
    (heart_eater the_lion)
    (not (heart_eater the_sultan))
))
)

; plan
1. (trick the_sultan the_shark)
   added: (trust the_shark the_sultan) (tricked_once the_shark)
   goals met: 2 of 5
2. (move the_hare cave forest)
   added: (in the_hare forest)
   goals met: 2 of 5
3. (trick the_hare the_donkey)
   added: (trust the_donkey the_hare) (tricked_once the_donkey)
   goals met: 2 of 5
4. (trick the_hare the_donkey)
   added: (tricked_twice the_donkey)
   goals met: 3 of 5
5. (move the_donkey forest cave)
   added: (in the_donkey cave)
   goals met: 3 of 5
6. (eat_heart the_lion the_donkey)
   added: (heart_eater the_lion)
   goals met: 4 of 5
7. (move the_sultan sea cliff)
   added: (in the_sultan cliff)
   goals met: 4 of 5
8. (move the_sultan cliff tree)
   added: (in the_sultan tree)
   goals met: 4 of 5
9. (trick the_sultan the_monkey)
   added: (trust the_monkey the_sultan) (tricked_once the_monkey)
   goals met: 5 of 5
